In [1]:
print("Hello World")

Hello World

In [8]:
import pandas as pd
ps = pd.Series([10,20,30,40])

In [17]:
ps[:3]

0    10
1    20
2    30
dtype: int64

In [21]:
ps = pd.Series([10,20,30,40,50,60,70,80,90,100])

In [19]:
ps[:]

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [20]:
ps[1:]

1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [22]:
ps[4:]

4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [23]:
ps[:5]

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [24]:
ps[1:8]

1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [25]:
datas = [10, 20, 30, 40, 50]

In [26]:
df = pd.DataFrame(datas)
df

    0
0  10
1  20
2  30
3  40
4  50

In [27]:
datas_tp = (59, 60, 25, 32)

In [28]:
df = pd.DataFrame(datas_tp) #Tuple
df

    0
0  59
1  60
2  25
3  32

In [29]:
# Addition Column
cols = ['Age']
df = pd.DataFrame(datas_tp, columns=cols)
df

   Age
0   59
1   60
2   25
3   32

In [33]:
datas = [['keyboard', 'IT',4000],['Doll', 'Toy', 500],['mouse', 'IT', 300],['Iphone12','Mobile',40000]]
cols = ['product_name', 'category', 'price']
df = pd.DataFrame(datas, columns=cols)
df

  product_name category  price
0     keyboard       IT   4000
1         Doll      Toy    500
2        mouse       IT    300
3     Iphone12   Mobile  40000

In [35]:
#use Zip To create DataFrame
product_name = ['keyboard', 'Doll','mouse']
category = ['IT', 'Toy', 'IT']
price = [400, 500, 300]
datas = list(zip(product_name,category,price))
cols = ['product_name', 'category', 'price']
df = pd.DataFrame(datas, columns=cols)
df

  product_name category  price
0     keyboard       IT    400
1         Doll      Toy    500
2        mouse       IT    300

In [10]:
#Create DataFrame from dictionary
import pandas as pd

products = [
    {"Name":"Keyboard","Category":"Hardware","Price":500},
    {"Name":"Mouse","Category":"Hardware","Price":300},
    {"Name":"Doll","Category":"Toy","Price":900},
    {"Name":"Durian","Category":"Fruit","Price":70}
]

In [13]:
df = pd.DataFrame(products)
df

       Name  Category  Price
0  Keyboard  Hardware    500
1     Mouse  Hardware    300
2      Doll       Toy    900
3    Durian     Fruit     70

In [16]:
#Set Index use by column
df.set_index(["Name"], inplace=True)

In [17]:
df

          Category  Price
Name
Keyboard  Hardware    500
Mouse     Hardware    300
Doll           Toy    900
Durian       Fruit     70

In [18]:
#Create Data frame from series
name = ['keyboard', 'mouse', 'Doll']
category = ['Hardware', 'Hardware', 'Toy']
price = [500, 300,900]

In [19]:
#Series
name_series = pd.Series(name)
category_series = pd.Series(category)
price_series = pd.Series(price)

In [21]:
frame = {"Name":name_series, "Category":category_series, "Price":price_series}

In [22]:
df = pd.DataFrame(frame)
df

       Name  Category  Price
0  keyboard  Hardware    500
1     mouse  Hardware    300
2      Doll       Toy    900

In [23]:
df.set_index(["Name"], inplace=True)
df

          Category  Price
Name
keyboard  Hardware    500
mouse     Hardware    300
Doll           Toy    900

## Export Dataframe to CSV file

In [29]:
df.to_csv("products.csv")

### Read Data From CSV file

In [30]:
dfs = pd.read_csv(r"D:\Learning_code\Python_Tutorial\products.csv", encoding="utf-8")

In [31]:
dfs

       Name  Category  Price
0  keyboard  Hardware    500
1     mouse  Hardware    300
2      Doll       Toy    900

In [34]:
cols = ["Name","Price"]
dfs = pd.read_csv(r"D:\Learning_code\Python_Tutorial\products.csv", encoding="utf-8", usecols=cols, 
                  index_col="Name")
dfs

          Price
Name
keyboard    500
mouse       300
Doll        900

In [35]:
dfs = pd.read_csv(r"D:\Learning_code\Python_Tutorial\products.csv", encoding="utf-8", index_col="Name")
dfs

          Category  Price
Name
keyboard  Hardware    500
mouse     Hardware    300
Doll           Toy    900

In [37]:
pd.read_csv("products3.csv")

  keyboard  Hardware  500
0    mouse  Hardware  300
1     Doll       Toy  900

In [38]:
colsname = ["name", "catagory", "price"]
df = pd.read_csv("products3.csv", encoding="utf-8", names=colsname)
df

       name  catagory  price
0  keyboard  Hardware    500
1     mouse  Hardware    300
2      Doll       Toy    900

### Read Excel & Statistic

In [1]:
import pandas as pd
df = pd.read_excel("dataupdate.xlsx", "weather", index_col="Day")
df

            Temperature  WindSpeed    Event
Day
2020-12-01           30          9  แดดร้อน
2020-12-02           28          8   เมฆมาก
2020-12-03           27          4     ฝนตก
2020-12-04           19          3  แดดร้อน
2020-12-05           20          5   เมฆมาก
2020-12-06           25          6     ฝนตก
2020-12-07           36          4     ฝนตก
2020-12-08           28          6     ฝนตก
2020-12-09           17          5   เมฆมาก
2020-12-10           24          6  แดดร้อน
2020-12-11           26          4     ฝนตก
2020-12-12           27          9  แดดร้อน
2020-12-13           30          2  แดดร้อน
2020-12-14           31          5   เมฆมาก
2020-12-15           28          4  แดดร้อน
2020-12-16           27          7  แดดร้อน
2020-12-17           20          8     ฝนตก
2020-12-18           18          5     ฝนตก
2020-12-19           25          7  แดดร้อน
2020-12-20           28          4   เมฆมาก
2020-12-21           25          5   เมฆมาก
2020-12-22           38          2   เมฆมาก
2020-12-23           34          3     ฝนตก
2020-12-24           29          4     ฝนตก
2020-12-25           34          5  แดดร้อน
2020-12-26           25          8     ฝนตก
2020-12-27           28          9   เมฆมาก
2020-12-28           30          2   เมฆมาก
2020-12-29           31          1     ฝนตก
2020-12-30           35          2     ฝนตก

In [44]:
df.head(5)

            Temperature  WindSpeed    Event
Day
2020-12-01           30          9  แดดร้อน
2020-12-02           28          8   เมฆมาก
2020-12-03           27          4     ฝนตก
2020-12-04           19          3  แดดร้อน
2020-12-05           20          5   เมฆมาก

In [22]:
df.sample(4)

            Temperature  WindSpeed   Event
Day
2020-12-18           18          5    ฝนตก
2020-12-02           28          8  เมฆมาก
2020-12-20           28          4  เมฆมาก
2020-12-29           31          1    ฝนตก

In [21]:
df.tail(3)

            Temperature  WindSpeed   Event
Day
2020-12-28           30          2  เมฆมาก
2020-12-29           31          1    ฝนตก
2020-12-30           35          2    ฝนตก

In [23]:
df.describe()

       Temperature  WindSpeed
count    30.000000  30.000000
mean     27.433333   5.066667
std       5.237026   2.288402
min      17.000000   1.000000
25%      25.000000   4.000000
50%      28.000000   5.000000
75%      30.000000   6.750000
max      38.000000   9.000000

In [25]:
df.shape

(30, 3)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 30 entries, 2020-12-01 to 2020-12-30
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Temperature  30 non-null     int64
 1   WindSpeed    30 non-null     int64
 2   Event        30 non-null     object
dtypes: int64(2), object(1)
memory usage: 960.0+ bytes

In [30]:
df.columns

Index(['Temperature', 'WindSpeed', 'Event'], dtype='object')

In [31]:
df.values

array([[30, 9, 'แดดร้อน'],
       [28, 8, 'เมฆมาก'],
       [27, 4, 'ฝนตก'],
       [19, 3, 'แดดร้อน'],
       [20, 5, 'เมฆมาก'],
       [25, 6, 'ฝนตก'],
       [36, 4, 'ฝนตก'],
       [28, 6, 'ฝนตก'],
       [17, 5, 'เมฆมาก'],
       [24, 6, 'แดดร้อน'],
       [26, 4, 'ฝนตก'],
       [27, 9, 'แดดร้อน'],
       [30, 2, 'แดดร้อน'],
       [31, 5, 'เมฆมาก'],
       [28, 4, 'แดดร้อน'],
       [27, 7, 'แดดร้อน'],
       [20, 8, 'ฝนตก'],
       [18, 5, 'ฝนตก'],
       [25, 7, 'แดดร้อน'],
       [28, 4, 'เมฆมาก'],
       [25, 5, 'เมฆมาก'],
       [38, 2, 'เมฆมาก'],
       [34, 3, 'ฝนตก'],
       [29, 4, 'ฝนตก'],
       [34, 5, 'แดดร้อน'],
       [25, 8, 'ฝนตก'],
       [28, 9, 'เมฆมาก'],
       [30, 2, 'เมฆมาก'],
       [31, 1, 'ฝนตก'],
       [35, 2, 'ฝนตก']], dtype=object)

In [34]:
df["Temperature"].sum()

823

In [35]:
df["Temperature"].max()

38

In [38]:
round(df.Temperature.mean(),2)

27.43

In [16]:
df.groupby("Event")["Temperature"].mean()

Event
ฝนตก       27.833333
เมฆมาก     27.222222
แดดร้อน    27.111111
Name: Temperature, dtype: float64

### Sorting Data & Filter

In [9]:
df.sort_values(by=["Temperature"], ascending=False).head(5)

            Temperature  WindSpeed    Event
Day
2020-12-22           38          2   เมฆมาก
2020-12-07           36          4     ฝนตก
2020-12-30           35          2     ฝนตก
2020-12-25           34          5  แดดร้อน
2020-12-23           34          3     ฝนตก

In [26]:
df[df["Temperature"] > 33]

            Temperature  WindSpeed    Event
Day
2020-12-07           36          4     ฝนตก
2020-12-22           38          2   เมฆมาก
2020-12-23           34          3     ฝนตก
2020-12-25           34          5  แดดร้อน
2020-12-30           35          2     ฝนตก

In [48]:
df[(df["Temperature"] > 30) & (df["Event"] == "ฝนตก")]

            Temperature  WindSpeed Event
Day
2020-12-07           36          4  ฝนตก
2020-12-14           31          5  ฝนตก
2020-12-22           38          2  ฝนตก
2020-12-23           34          3  ฝนตก
2020-12-25           34          5  ฝนตก
2020-12-29           31          1  ฝนตก
2020-12-30           35          2  ฝนตก

### Slicer By Column

In [51]:
df.Temperature[:]

Day
2020-12-01    30
2020-12-02    28
2020-12-03    27
2020-12-04    19
2020-12-05    20
2020-12-06    25
2020-12-07    36
2020-12-08    28
2020-12-09    17
2020-12-10    24
2020-12-11    26
2020-12-12    27
2020-12-13    30
2020-12-14    31
2020-12-15    28
2020-12-16    27
2020-12-17    20
2020-12-18    18
2020-12-19    25
2020-12-20    28
2020-12-21    25
2020-12-22    38
2020-12-23    34
2020-12-24    29
2020-12-25    34
2020-12-26    25
2020-12-27    28
2020-12-28    30
2020-12-29    31
2020-12-30    35
Name: Temperature, dtype: int64

In [48]:
df.Temperature[0:3]

Day
2020-12-01    30
2020-12-02    28
2020-12-03    27
Name: Temperature, dtype: int64

In [50]:
df.Temperature[10:20]

Day
2020-12-11    26
2020-12-12    27
2020-12-13    30
2020-12-14    31
2020-12-15    28
2020-12-16    27
2020-12-17    20
2020-12-18    18
2020-12-19    25
2020-12-20    28
Name: Temperature, dtype: int64

In [55]:
df[["Temperature","Event"]][1:4]

            Temperature    Event
Day
2020-12-02           28   เมฆมาก
2020-12-03           27     ฝนตก
2020-12-04           19  แดดร้อน

### Slicer By Row

In [56]:
df[:5]

            Temperature  WindSpeed    Event
Day
2020-12-01           30          9  แดดร้อน
2020-12-02           28          8   เมฆมาก
2020-12-03           27          4     ฝนตก
2020-12-04           19          3  แดดร้อน
2020-12-05           20          5   เมฆมาก

In [59]:
df[0:3].Event

Day
2020-12-01    แดดร้อน
2020-12-02     เมฆมาก
2020-12-03       ฝนตก
Name: Event, dtype: object

In [64]:
import pandas as pd
df = pd.read_excel("dataupdate.xlsx", "weather", index_col="Day")

In [69]:
df[0:3].Event

Day
2020-12-01    แดดร้อน
2020-12-02     เมฆมาก
2020-12-03       ฝนตก
Name: Event, dtype: object

In [70]:
# Case use some Columns to Index Like Day column

df.loc["2020-12-02":"2020-12-15"]["Event"]

Day
2020-12-02     เมฆมาก
2020-12-03       ฝนตก
2020-12-04    แดดร้อน
2020-12-05     เมฆมาก
2020-12-06       ฝนตก
2020-12-07       ฝนตก
2020-12-08       ฝนตก
2020-12-09     เมฆมาก
2020-12-10    แดดร้อน
2020-12-11       ฝนตก
2020-12-12    แดดร้อน
2020-12-13    แดดร้อน
2020-12-14     เมฆมาก
2020-12-15    แดดร้อน
Name: Event, dtype: object

### Search Data Match & Contains

In [2]:
import pandas as pd
df = pd.read_excel("dataupdate.xlsx", "weather", index_col="Day")
df

            Temperature  WindSpeed    Event
Day
2020-12-01           30          9  แดดร้อน
2020-12-02           28          8   เมฆมาก
2020-12-03           27          4     ฝนตก
2020-12-04           19          3  แดดร้อน
2020-12-05           20          5   เมฆมาก
2020-12-06           25          6     ฝนตก
2020-12-07           36          4     ฝนตก
2020-12-08           28          6     ฝนตก
2020-12-09           17          5   เมฆมาก
2020-12-10           24          6  แดดร้อน
2020-12-11           26          4     ฝนตก
2020-12-12           27          9  แดดร้อน
2020-12-13           30          2  แดดร้อน
2020-12-14           31          5   เมฆมาก
2020-12-15           28          4  แดดร้อน
2020-12-16           27          7  แดดร้อน
2020-12-17           20          8     ฝนตก
2020-12-18           18          5     ฝนตก
2020-12-19           25          7  แดดร้อน
2020-12-20           28          4   เมฆมาก
2020-12-21           25          5   เมฆมาก
2020-12-22           38          2   เมฆมาก
2020-12-23           34          3     ฝนตก
2020-12-24           29          4     ฝนตก
2020-12-25           34          5  แดดร้อน
2020-12-26           25          8     ฝนตก
2020-12-27           28          9   เมฆมาก
2020-12-28           30          2   เมฆมาก
2020-12-29           31          1     ฝนตก
2020-12-30           35          2     ฝนตก

In [4]:
df[df.Event.str.match("ฝนตก")]

            Temperature  WindSpeed Event
Day
2020-12-03           27          4  ฝนตก
2020-12-06           25          6  ฝนตก
2020-12-07           36          4  ฝนตก
2020-12-08           28          6  ฝนตก
2020-12-11           26          4  ฝนตก
2020-12-17           20          8  ฝนตก
2020-12-18           18          5  ฝนตก
2020-12-23           34          3  ฝนตก
2020-12-24           29          4  ฝนตก
2020-12-26           25          8  ฝนตก
2020-12-29           31          1  ฝนตก
2020-12-30           35          2  ฝนตก

In [7]:
df.loc[df["Event"] == "ฝนตก"]

            Temperature  WindSpeed Event
Day
2020-12-03           27          4  ฝนตก
2020-12-06           25          6  ฝนตก
2020-12-07           36          4  ฝนตก
2020-12-08           28          6  ฝนตก
2020-12-11           26          4  ฝนตก
2020-12-17           20          8  ฝนตก
2020-12-18           18          5  ฝนตก
2020-12-23           34          3  ฝนตก
2020-12-24           29          4  ฝนตก
2020-12-26           25          8  ฝนตก
2020-12-29           31          1  ฝนตก
2020-12-30           35          2  ฝนตก

In [8]:
df[df.Event.str.contains("ก")]

            Temperature  WindSpeed   Event
Day
2020-12-02           28          8  เมฆมาก
2020-12-03           27          4    ฝนตก
2020-12-05           20          5  เมฆมาก
2020-12-06           25          6    ฝนตก
2020-12-07           36          4    ฝนตก
2020-12-08           28          6    ฝนตก
2020-12-09           17          5  เมฆมาก
2020-12-11           26          4    ฝนตก
2020-12-14           31          5  เมฆมาก
2020-12-17           20          8    ฝนตก
2020-12-18           18          5    ฝนตก
2020-12-20           28          4  เมฆมาก
2020-12-21           25          5  เมฆมาก
2020-12-22           38          2  เมฆมาก
2020-12-23           34          3    ฝนตก
2020-12-24           29          4    ฝนตก
2020-12-26           25          8    ฝนตก
2020-12-27           28          9  เมฆมาก
2020-12-28           30          2  เมฆมาก
2020-12-29           31          1    ฝนตก
2020-12-30           35          2    ฝนตก

#### Loop to find data in dataframe

In [4]:
for col_idx,data in df.iterrows():
    print ("row:",col_idx)
    print ("row data:")
    print (data,"\n")

row: 2020-12-01 00:00:00
row data:
Temperature         30
WindSpeed            9
Event          แดดร้อน
Name: 2020-12-01 00:00:00, dtype: object

row: 2020-12-02 00:00:00
row data:
Temperature        28
WindSpeed           8
Event          เมฆมาก
Name: 2020-12-02 00:00:00, dtype: object

row: 2020-12-03 00:00:00
row data:
Temperature      27
WindSpeed         4
Event          ฝนตก
Name: 2020-12-03 00:00:00, dtype: object

row: 2020-12-04 00:00:00
row data:
Temperature         19
WindSpeed            3
Event          แดดร้อน
Name: 2020-12-04 00:00:00, dtype: object

row: 2020-12-05 00:00:00
row data:
Temperature        20
WindSpeed           5
Event          เมฆมาก
Name: 2020-12-05 00:00:00, dtype: object

row: 2020-12-06 00:00:00
row data:
Temperature      25
WindSpeed         6
Event          ฝนตก
Name: 2020-12-06 00:00:00, dtype: object

row: 2020-12-07 00:00:00
row data:
Temperature      36
WindSpeed         4
Event          ฝนตก
Name: 2020-12-07 00:00:00, dtype: object

row: 2020-12-08 00:00:00
row data:
Temperature      28
WindSpeed         6
Event          ฝนตก
Name: 2020-12-08 00:00:00, dtype: object

row: 2020-12-09 00:00:00
row data:
Temperature        17
WindSpeed           5
Event          เมฆมาก
Name: 2020-12-09 00:00:00, dtype: object

row: 2020-12-10 00:00:00
row data:
Temperature         24
WindSpeed            6
Event          แดดร้อน
Name: 2020-12-10 00:00:00, dtype: object

row: 2020-12-11 00:00:00
row data:
Temperature      26
WindSpeed         4
Event          ฝนตก
Name: 2020-12-11 00:00:00, dtype: object

row: 2020-12-12 00:00:00
row data:
Temperature         27
WindSpeed            9
Event          แดดร้อน
Name: 2020-12-12 00:00:00, dtype: object

row: 2020-12-13 00:00:00
row data:
Temperature         30
WindSpeed            2
Event          แดดร้อน
Name: 2020-12-13 00:00:00, dtype: object

row: 2020-12-14 00:00:00
row data:
Temperature        31
WindSpeed           5
Event          เมฆมาก
Name: 2020-12-14 00:00:00, dtype: object

row: 2020-12-15 00:00:00
row data:
Temperature         28
WindSpeed            4
Event          แดดร้อน
Name: 2020-12-15 00:00:00, dtype: object

row: 2020-12-16 00:00:00
row data:
Temperature         27
WindSpeed            7
Event          แดดร้อน
Name: 2020-12-16 00:00:00, dtype: object

row: 2020-12-17 00:00:00
row data:
Temperature      20
WindSpeed         8
Event          ฝนตก
Name: 2020-12-17 00:00:00, dtype: object

row: 2020-12-18 00:00:00
row data:
Temperature      18
WindSpeed         5
Event          ฝนตก
Name: 2020-12-18 00:00:00, dtype: object

row: 2020-12-19 00:00:00
row data:
Temperature         25
WindSpeed            7
Event          แดดร้อน
Name: 2020-12-19 00:00:00, dtype: object

row: 2020-12-20 00:00:00
row data:
Temperature        28
WindSpeed           4
Event          เมฆมาก
Name: 2020-12-20 00:00:00, dtype: object

row: 2020-12-21 00:00:00
row data:
Temperature        25
WindSpeed           5
Event          เมฆมาก
Name: 2020-12-21 00:00:00, dtype: object

row: 2020-12-22 00:00:00
row data:
Temperature        38
WindSpeed           2
Event          เมฆมาก
Name: 2020-12-22 00:00:00, dtype: object

row: 2020-12-23 00:00:00
row data:
Temperature      34
WindSpeed         3
Event          ฝนตก
Name: 2020-12-23 00:00:00, dtype: object

row: 2020-12-24 00:00:00
row data:
Temperature      29
WindSpeed         4
Event          ฝนตก
Name: 2020-12-24 00:00:00, dtype: object

row: 2020-12-25 00:00:00
row data:
Temperature         34
WindSpeed            5
Event          แดดร้อน
Name: 2020-12-25 00:00:00, dtype: object

row: 2020-12-26 00:00:00
row data:
Temperature      25
WindSpeed         8
Event          ฝนตก
Name: 2020-12-26 00:00:00, dtype: object

row: 2020-12-27 00:00:00
row data:
Temperature        28
WindSpeed           9
Event          เมฆมาก
Name: 2020-12-27 00:00:00, dtype: object

row: 2020-12-28 00:00:00
row data:
Temperature        30
WindSpeed           2
Event          เมฆมาก
Name: 2020-12-28 00:00:00, dtype: object

row: 2020-12-29 00:00:00
row data:
Temperature      31
WindSpeed         1
Event          ฝนตก
Name: 2020-12-29 00:00:00, dtype: object

row: 2020-12-30 00:00:00
row data:
Temperature      35
WindSpeed         2
Event          ฝนตก
Name: 2020-12-30 00:00:00, dtype: object

In [13]:
for idx, row in df.iterrows():
    print(f"อุณหภูมิ = {row.Temperature} ส่งผลให้เกิด {row.Event}") #use f-string

อุณหภูมิ = 30 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 28 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 27 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 19 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 20 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 25 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 36 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 28 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 17 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 24 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 26 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 27 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 30 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 31 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 28 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 27 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 20 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 18 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 25 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 28 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 25 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 38 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 34 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 29 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 34 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 25 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 28 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 30 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 31 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 35 ส่งผลให้เกิด ฝนตก

In [14]:
#use format
for idx, row in df.iterrows():
    print("อุณหภูมิ = {} ส่งผลให้เกิด {}".format(row.Temperature, row.Event))

อุณหภูมิ = 30 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 28 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 27 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 19 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 20 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 25 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 36 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 28 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 17 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 24 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 26 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 27 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 30 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 31 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 28 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 27 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 20 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 18 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 25 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 28 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 25 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 38 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 34 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 29 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 34 ส่งผลให้เกิด แดดร้อน
อุณหภูมิ = 25 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 28 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 30 ส่งผลให้เกิด เมฆมาก
อุณหภูมิ = 31 ส่งผลให้เกิด ฝนตก
อุณหภูมิ = 35 ส่งผลให้เกิด ฝนตก

#### Choose Data with condition

In [17]:
df[df["Temperature"] <= 20].sort_values(by="Temperature", ascending=False)

            Temperature  WindSpeed    Event
Day
2020-12-05           20          5   เมฆมาก
2020-12-17           20          8     ฝนตก
2020-12-04           19          3  แดดร้อน
2020-12-18           18          5     ฝนตก
2020-12-09           17          5   เมฆมาก

In [18]:
df[df["Event"] == "แดดร้อน"]

            Temperature  WindSpeed    Event
Day
2020-12-01           30          9  แดดร้อน
2020-12-04           19          3  แดดร้อน
2020-12-10           24          6  แดดร้อน
2020-12-12           27          9  แดดร้อน
2020-12-13           30          2  แดดร้อน
2020-12-15           28          4  แดดร้อน
2020-12-16           27          7  แดดร้อน
2020-12-19           25          7  แดดร้อน
2020-12-25           34          5  แดดร้อน

In [20]:
df[(df["Event"] == "ฝนตก") & (df["Temperature"] >= 35)]

            Temperature  WindSpeed Event
Day
2020-12-07           36          4  ฝนตก
2020-12-30           35          2  ฝนตก

In [32]:
df.loc[(df.Event == "เมฆมาก") | (df.Temperature <= 18)]

            Temperature  WindSpeed   Event
Day
2020-12-02           28          8  เมฆมาก
2020-12-05           20          5  เมฆมาก
2020-12-09           17          5  เมฆมาก
2020-12-14           31          5  เมฆมาก
2020-12-18           18          5    ฝนตก
2020-12-20           28          4  เมฆมาก
2020-12-21           25          5  เมฆมาก
2020-12-22           38          2  เมฆมาก
2020-12-27           28          9  เมฆมาก
2020-12-28           30          2  เมฆมาก

In [38]:
df.loc[(df.Event == "เมฆมาก") | (df.Temperature == 20) | (df.Temperature == 25)]

            Temperature  WindSpeed    Event
Day
2020-12-02           28          8   เมฆมาก
2020-12-05           20          5   เมฆมาก
2020-12-06           25          6     ฝนตก
2020-12-09           17          5   เมฆมาก
2020-12-14           31          5   เมฆมาก
2020-12-17           20          8     ฝนตก
2020-12-19           25          7  แดดร้อน
2020-12-20           28          4   เมฆมาก
2020-12-21           25          5   เมฆมาก
2020-12-22           38          2   เมฆมาก
2020-12-26           25          8     ฝนตก
2020-12-27           28          9   เมฆมาก
2020-12-28           30          2   เมฆมาก

In [43]:
# isin meaning like multiple or
df.loc[(df.Temperature.isin([18, 20, 25, 35]))]

            Temperature  WindSpeed    Event
Day
2020-12-05           20          5   เมฆมาก
2020-12-06           25          6     ฝนตก
2020-12-17           20          8     ฝนตก
2020-12-18           18          5     ฝนตก
2020-12-19           25          7  แดดร้อน
2020-12-21           25          5   เมฆมาก
2020-12-26           25          8     ฝนตก
2020-12-30           35          2     ฝนตก

In [56]:
df.loc[(df.Temperature.isin([25, 30])) & (df.Event == "แดดร้อน")]

            Temperature  WindSpeed    Event
Day
2020-12-01           30          9  แดดร้อน
2020-12-13           30          2  แดดร้อน
2020-12-19           25          7  แดดร้อน

#### Sorting Data in DataFrame

In [78]:
import pandas as pd
df = pd.read_excel("Stock.xlsx", index_col="Name")
df

                             Category  Price  Amount
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
ปากกา                 อุปกรณ์การเรียน    200       5
โคมไฟ                เครื่องใช้ในบ้าน   1200       7
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0
เสื้อยืดคอกลม                เสื้อผ้า    500       2
กางเกงยีนต์                  เสื้อผ้า    999       8
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
โซฟา                     เฟอร์นิเจอร์   5000       5
จาน                       เครื่องครัว    250       4
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7
ยางลบ                 อุปกรณ์การเรียน     20       5
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
รถบังคับ                      ของเล่น    500       6

In [79]:
result = df.sort_index()
result

                             Category  Price  Amount
Name
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
กางเกงยีนต์                  เสื้อผ้า    999       8
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
จาน                       เครื่องครัว    250       4
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7
ปากกา                 อุปกรณ์การเรียน    200       5
ยางลบ                 อุปกรณ์การเรียน     20       5
รถบังคับ                      ของเล่น    500       6
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
เสื้อยืดคอกลม                เสื้อผ้า    500       2
โคมไฟ                เครื่องใช้ในบ้าน   1200       7
โซฟา                     เฟอร์นิเจอร์   5000       5
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1

In [59]:
df.sort_values(by="Price")

                             Category  Price  Amount
Name
ยางลบ                 อุปกรณ์การเรียน     20       5
ปากกา                 อุปกรณ์การเรียน    200       5
จาน                       เครื่องครัว    250       4
เสื้อยืดคอกลม                เสื้อผ้า    500       2
รถบังคับ                      ของเล่น    500       6
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
กางเกงยีนต์                  เสื้อผ้า    999       8
โคมไฟ                เครื่องใช้ในบ้าน   1200       7
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0
โซฟา                     เฟอร์นิเจอร์   5000       5
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7

In [60]:
df.sort_values(by="Amount", ascending=False)

                             Category  Price  Amount
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
กางเกงยีนต์                  เสื้อผ้า    999       8
โคมไฟ                เครื่องใช้ในบ้าน   1200       7
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
รถบังคับ                      ของเล่น    500       6
ปากกา                 อุปกรณ์การเรียน    200       5
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
โซฟา                     เฟอร์นิเจอร์   5000       5
ยางลบ                 อุปกรณ์การเรียน     20       5
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
จาน                       เครื่องครัว    250       4
เสื้อยืดคอกลม                เสื้อผ้า    500       2
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0

#### Add Column To Dataframe & Rename column

In [80]:
df["delivery"] = 100

In [81]:
df["total"] = df["Price"] + df["delivery"]

df

                             Category  Price  Amount  delivery  total
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10       100   1000
ปากกา                 อุปกรณ์การเรียน    200       5       100    300
โคมไฟ                เครื่องใช้ในบ้าน   1200       7       100   1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1       100    850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0       100   3600
เสื้อยืดคอกลม                เสื้อผ้า    500       2       100    600
กางเกงยีนต์                  เสื้อผ้า    999       8       100   1099
ตุ๊กตาหมีพูห์                 ของเล่น    950       5       100   1050
โซฟา                     เฟอร์นิเจอร์   5000       5       100   5100
จาน                       เครื่องครัว    250       4       100    350
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7       100  15100
ยางลบ                 อุปกรณ์การเรียน     20       5       100    120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7       100   2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5       100    950
รถบังคับ                      ของเล่น    500       6       100    600

In [82]:
# Rename columns
cols = {"Category":"Group"}

df.rename(columns= cols, inplace=True)
df

                                Group  Price  Amount  delivery  total
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10       100   1000
ปากกา                 อุปกรณ์การเรียน    200       5       100    300
โคมไฟ                เครื่องใช้ในบ้าน   1200       7       100   1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1       100    850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0       100   3600
เสื้อยืดคอกลม                เสื้อผ้า    500       2       100    600
กางเกงยีนต์                  เสื้อผ้า    999       8       100   1099
ตุ๊กตาหมีพูห์                 ของเล่น    950       5       100   1050
โซฟา                     เฟอร์นิเจอร์   5000       5       100   5100
จาน                       เครื่องครัว    250       4       100    350
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7       100  15100
ยางลบ                 อุปกรณ์การเรียน     20       5       100    120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7       100   2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5       100    950
รถบังคับ                      ของเล่น    500       6       100    600

In [83]:
cols = {"Price":"cost","Amount":"Quantity","total":"Summation"}
df.rename(columns= cols, inplace=True)
df

                                Group   cost  Quantity  delivery  Summation
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900        10       100       1000
ปากกา                 อุปกรณ์การเรียน    200         5       100        300
โคมไฟ                เครื่องใช้ในบ้าน   1200         7       100       1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750         1       100        850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500         0       100       3600
เสื้อยืดคอกลม                เสื้อผ้า    500         2       100        600
กางเกงยีนต์                  เสื้อผ้า    999         8       100       1099
ตุ๊กตาหมีพูห์                 ของเล่น    950         5       100       1050
โซฟา                     เฟอร์นิเจอร์   5000         5       100       5100
จาน                       เครื่องครัว    250         4       100        350
ทีวี                  เครื่องใช้ไฟฟ้า  15000         7       100      15100
ยางลบ                 อุปกรณ์การเรียน     20         5       100        120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500         7       100       2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850         5       100        950
รถบังคับ                      ของเล่น    500         6       100        600

#### Delete Column

In [84]:
df.drop("delivery", axis=1)

                                Group   cost  Quantity  Summation
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900        10       1000
ปากกา                 อุปกรณ์การเรียน    200         5        300
โคมไฟ                เครื่องใช้ในบ้าน   1200         7       1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750         1        850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500         0       3600
เสื้อยืดคอกลม                เสื้อผ้า    500         2        600
กางเกงยีนต์                  เสื้อผ้า    999         8       1099
ตุ๊กตาหมีพูห์                 ของเล่น    950         5       1050
โซฟา                     เฟอร์นิเจอร์   5000         5       5100
จาน                       เครื่องครัว    250         4        350
ทีวี                  เครื่องใช้ไฟฟ้า  15000         7      15100
ยางลบ                 อุปกรณ์การเรียน     20         5        120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500         7       2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850         5        950
รถบังคับ                      ของเล่น    500         6        600

In [85]:
df.drop("delivery", axis=1, inplace=True)

In [86]:
df

                                Group   cost  Quantity  Summation
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900        10       1000
ปากกา                 อุปกรณ์การเรียน    200         5        300
โคมไฟ                เครื่องใช้ในบ้าน   1200         7       1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750         1        850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500         0       3600
เสื้อยืดคอกลม                เสื้อผ้า    500         2        600
กางเกงยีนต์                  เสื้อผ้า    999         8       1099
ตุ๊กตาหมีพูห์                 ของเล่น    950         5       1050
โซฟา                     เฟอร์นิเจอร์   5000         5       5100
จาน                       เครื่องครัว    250         4        350
ทีวี                  เครื่องใช้ไฟฟ้า  15000         7      15100
ยางลบ                 อุปกรณ์การเรียน     20         5        120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500         7       2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850         5        950
รถบังคับ                      ของเล่น    500         6        600

#### Add Data or Row In dataframe

In [87]:
df

                                Group   cost  Quantity  Summation
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900        10       1000
ปากกา                 อุปกรณ์การเรียน    200         5        300
โคมไฟ                เครื่องใช้ในบ้าน   1200         7       1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750         1        850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500         0       3600
เสื้อยืดคอกลม                เสื้อผ้า    500         2        600
กางเกงยีนต์                  เสื้อผ้า    999         8       1099
ตุ๊กตาหมีพูห์                 ของเล่น    950         5       1050
โซฟา                     เฟอร์นิเจอร์   5000         5       5100
จาน                       เครื่องครัว    250         4        350
ทีวี                  เครื่องใช้ไฟฟ้า  15000         7      15100
ยางลบ                 อุปกรณ์การเรียน     20         5        120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500         7       2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850         5        950
รถบังคับ                      ของเล่น    500         6        600

In [97]:
products = [
            ["หูฟัง","อุปกรณ์คอม",400,20,500],
            ["สายชาร์จ","อุปกรณ์คอม",1400,20,1500]
            ]

cols = ["Name","Group","cost","Quantity","Summation"]
newdf = pd.DataFrame(data=products, columns=cols)
newdf

       Name       Group  cost  Quantity  Summation
0     หูฟัง  อุปกรณ์คอม   400        20        500
1  สายชาร์จ  อุปกรณ์คอม  1400        20       1500

In [98]:
newdf.set_index("Name", inplace=True)

newdf

               Group  cost  Quantity  Summation
Name
หูฟัง     อุปกรณ์คอม   400        20        500
สายชาร์จ  อุปกรณ์คอม  1400        20       1500

In [99]:
df

                                Group   cost  Quantity  Summation
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900        10       1000
ปากกา                 อุปกรณ์การเรียน    200         5        300
โคมไฟ                เครื่องใช้ในบ้าน   1200         7       1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750         1        850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500         0       3600
เสื้อยืดคอกลม                เสื้อผ้า    500         2        600
กางเกงยีนต์                  เสื้อผ้า    999         8       1099
ตุ๊กตาหมีพูห์                 ของเล่น    950         5       1050
โซฟา                     เฟอร์นิเจอร์   5000         5       5100
จาน                       เครื่องครัว    250         4        350
ทีวี                  เครื่องใช้ไฟฟ้า  15000         7      15100
ยางลบ                 อุปกรณ์การเรียน     20         5        120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500         7       2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850         5        950
รถบังคับ                      ของเล่น    500         6        600

In [106]:
# in Pandas 2.0 they remove append new we use concat replace append
df = pd.concat([df, newdf])

In [107]:
df

                                Group   cost  Quantity  Summation
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900        10       1000
ปากกา                 อุปกรณ์การเรียน    200         5        300
โคมไฟ                เครื่องใช้ในบ้าน   1200         7       1300
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750         1        850
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500         0       3600
เสื้อยืดคอกลม                เสื้อผ้า    500         2        600
กางเกงยีนต์                  เสื้อผ้า    999         8       1099
ตุ๊กตาหมีพูห์                 ของเล่น    950         5       1050
โซฟา                     เฟอร์นิเจอร์   5000         5       5100
จาน                       เครื่องครัว    250         4        350
ทีวี                  เครื่องใช้ไฟฟ้า  15000         7      15100
ยางลบ                 อุปกรณ์การเรียน     20         5        120
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500         7       2600
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850         5        950
รถบังคับ                      ของเล่น    500         6        600
หูฟัง                      อุปกรณ์คอม    400        20        500
สายชาร์จ                   อุปกรณ์คอม   1400        20       1500

#### Remove row By using Index

In [1]:
import pandas as pd
df = pd.read_excel("Stock.xlsx")
df

                 Name            Category  Price  Amount
0               เมาส์  อุปกรณ์คอมพิวเตอร์    900      10
1               ปากกา     อุปกรณ์การเรียน    200       5
2               โคมไฟ    เครื่องใช้ในบ้าน   1200       7
3            ไมโครโฟน     เครื่องใช้ไฟฟ้า    750       1
4       เครื่องซักผ้า     เครื่องใช้ไฟฟ้า   3500       0
5       เสื้อยืดคอกลม            เสื้อผ้า    500       2
6         กางเกงยีนต์            เสื้อผ้า    999       8
7       ตุ๊กตาหมีพูห์             ของเล่น    950       5
8                โซฟา        เฟอร์นิเจอร์   5000       5
9                 จาน         เครื่องครัว    250       4
10               ทีวี     เครื่องใช้ไฟฟ้า  15000       7
11              ยางลบ     อุปกรณ์การเรียน     20       5
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850       5
14           รถบังคับ             ของเล่น    500       6

In [2]:
rows = 9
df.drop(rows, axis=0, inplace=True)
df

                 Name            Category  Price  Amount
0               เมาส์  อุปกรณ์คอมพิวเตอร์    900      10
1               ปากกา     อุปกรณ์การเรียน    200       5
2               โคมไฟ    เครื่องใช้ในบ้าน   1200       7
3            ไมโครโฟน     เครื่องใช้ไฟฟ้า    750       1
4       เครื่องซักผ้า     เครื่องใช้ไฟฟ้า   3500       0
5       เสื้อยืดคอกลม            เสื้อผ้า    500       2
6         กางเกงยีนต์            เสื้อผ้า    999       8
7       ตุ๊กตาหมีพูห์             ของเล่น    950       5
8                โซฟา        เฟอร์นิเจอร์   5000       5
10               ทีวี     เครื่องใช้ไฟฟ้า  15000       7
11              ยางลบ     อุปกรณ์การเรียน     20       5
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850       5
14           รถบังคับ             ของเล่น    500       6

In [3]:
rows = [0, 3, 10]
df.drop(rows, axis=0, inplace=True)
df

                 Name            Category  Price  Amount
1               ปากกา     อุปกรณ์การเรียน    200       5
2               โคมไฟ    เครื่องใช้ในบ้าน   1200       7
4       เครื่องซักผ้า     เครื่องใช้ไฟฟ้า   3500       0
5       เสื้อยืดคอกลม            เสื้อผ้า    500       2
6         กางเกงยีนต์            เสื้อผ้า    999       8
7       ตุ๊กตาหมีพูห์             ของเล่น    950       5
8                โซฟา        เฟอร์นิเจอร์   5000       5
11              ยางลบ     อุปกรณ์การเรียน     20       5
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850       5
14           รถบังคับ             ของเล่น    500       6

In [5]:
df = pd.read_excel("Stock.xlsx", index_col="Name")
df

                             Category  Price  Amount
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
ปากกา                 อุปกรณ์การเรียน    200       5
โคมไฟ                เครื่องใช้ในบ้าน   1200       7
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0
เสื้อยืดคอกลม                เสื้อผ้า    500       2
กางเกงยีนต์                  เสื้อผ้า    999       8
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
โซฟา                     เฟอร์นิเจอร์   5000       5
จาน                       เครื่องครัว    250       4
ทีวี                  เครื่องใช้ไฟฟ้า  15000       7
ยางลบ                 อุปกรณ์การเรียน     20       5
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
รถบังคับ                      ของเล่น    500       6

In [6]:
row = "ทีวี"
df.drop(row, axis=0, inplace=True)
df

                             Category  Price  Amount
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
ปากกา                 อุปกรณ์การเรียน    200       5
โคมไฟ                เครื่องใช้ในบ้าน   1200       7
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0
เสื้อยืดคอกลม                เสื้อผ้า    500       2
กางเกงยีนต์                  เสื้อผ้า    999       8
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
โซฟา                     เฟอร์นิเจอร์   5000       5
จาน                       เครื่องครัว    250       4
ยางลบ                 อุปกรณ์การเรียน     20       5
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
รถบังคับ                      ของเล่น    500       6

In [8]:
row = ["ปากกา", "โคมไฟ", "โซฟา", "ยางลบ"]
df.drop(row, axis=0, inplace=True)
df

                             Category  Price  Amount
Name
เมาส์              อุปกรณ์คอมพิวเตอร์    900      10
ไมโครโฟน              เครื่องใช้ไฟฟ้า    750       1
เครื่องซักผ้า         เครื่องใช้ไฟฟ้า   3500       0
เสื้อยืดคอกลม                เสื้อผ้า    500       2
กางเกงยีนต์                  เสื้อผ้า    999       8
ตุ๊กตาหมีพูห์                 ของเล่น    950       5
จาน                       เครื่องครัว    250       4
External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
คีย์บอร์ด          อุปกรณ์คอมพิวเตอร์    850       5
รถบังคับ                      ของเล่น    500       6

#### Grand total row and column

In [9]:
df = pd.read_excel("Stock.xlsx")
df

                 Name            Category  Price  Amount
0               เมาส์  อุปกรณ์คอมพิวเตอร์    900      10
1               ปากกา     อุปกรณ์การเรียน    200       5
2               โคมไฟ    เครื่องใช้ในบ้าน   1200       7
3            ไมโครโฟน     เครื่องใช้ไฟฟ้า    750       1
4       เครื่องซักผ้า     เครื่องใช้ไฟฟ้า   3500       0
5       เสื้อยืดคอกลม            เสื้อผ้า    500       2
6         กางเกงยีนต์            เสื้อผ้า    999       8
7       ตุ๊กตาหมีพูห์             ของเล่น    950       5
8                โซฟา        เฟอร์นิเจอร์   5000       5
9                 จาน         เครื่องครัว    250       4
10               ทีวี     เครื่องใช้ไฟฟ้า  15000       7
11              ยางลบ     อุปกรณ์การเรียน     20       5
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850       5
14           รถบังคับ             ของเล่น    500       6

In [15]:
# axis = 0 get grand total by column axis = 1 get grand total by row
df.sum(axis=0)

Name        เมาส์ปากกาโคมไฟไมโครโฟนเครื่องซักผ้าเสื้อยืดคอ...
Category    อุปกรณ์คอมพิวเตอร์อุปกรณ์การเรียนเครื่องใช้ในบ...
Price                                                   33119
Amount                                                     77
dtype: object

In [44]:
#df.iloc[row, column]
df.iloc[:, 2:4].sum(axis=1)

0       910
1       205
2      1207
3       751
4      3500
5       502
6      1007
7       955
8      5005
9       254
10    15007
11       25
12     2507
13      855
14      506
dtype: int64

In [51]:
df[["Price", "Amount"]].sum(axis=1)

0       910
1       205
2      1207
3       751
4      3500
5       502
6      1007
7       955
8      5005
9       254
10    15007
11       25
12     2507
13      855
14      506
dtype: int64

In [53]:
df["total"] = df["Price"] * df["Amount"]
df

                 Name            Category  Price  Amount   total
0               เมาส์  อุปกรณ์คอมพิวเตอร์    900      10    9000
1               ปากกา     อุปกรณ์การเรียน    200       5    1000
2               โคมไฟ    เครื่องใช้ในบ้าน   1200       7    8400
3            ไมโครโฟน     เครื่องใช้ไฟฟ้า    750       1     750
4       เครื่องซักผ้า     เครื่องใช้ไฟฟ้า   3500       0       0
5       เสื้อยืดคอกลม            เสื้อผ้า    500       2    1000
6         กางเกงยีนต์            เสื้อผ้า    999       8    7992
7       ตุ๊กตาหมีพูห์             ของเล่น    950       5    4750
8                โซฟา        เฟอร์นิเจอร์   5000       5   25000
9                 จาน         เครื่องครัว    250       4    1000
10               ทีวี     เครื่องใช้ไฟฟ้า  15000       7  105000
11              ยางลบ     อุปกรณ์การเรียน     20       5     100
12  External HardDisk  อุปกรณ์คอมพิวเตอร์   2500       7   17500
13          คีย์บอร์ด  อุปกรณ์คอมพิวเตอร์    850       5    4250
14           รถบังคับ             ของเล่น    500       6    3000

In [54]:
df.sum(axis=0)

Name        เมาส์ปากกาโคมไฟไมโครโฟนเครื่องซักผ้าเสื้อยืดคอ...
Category    อุปกรณ์คอมพิวเตอร์อุปกรณ์การเรียนเครื่องใช้ในบ...
Price                                                   33119
Amount                                                     77
total                                                  188742
dtype: object

#### handle Missing Values

In [56]:
import pandas as pd
df = pd.read_excel("Employee.xlsx", index_col="Name")
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN       NaN    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [59]:
# True has Nan Values Flase Has Values
df.isnull()

                 Job    Age  Salary  Bonus  Address
Name
อาทิตย์        False  False   False  False     True
เกียรติศักดิ์  False  False    True  False     True
จักรพงษ์       False   True   False  False     True
สุรชัย          True  False   False  False     True
ทศพล           False  False   False  False     True
จินตนา         False   True   False  False     True
NaN             True   True    True   True     True
เกษมสันต์      False  False   False  False     True
ชลธิชา          True  False   False  False     True
เกษมสันต์      False  False   False  False     True
ทศพล           False  False   False  False     True

In [62]:
# Find which column has Nan Values True is mean that column has null value
df.isnull().any()

Job        True
Age        True
Salary     True
Bonus      True
Address    True
dtype: bool

In [64]:
# Find how many null in each columns
df.isnull().sum()

Job         3
Age         3
Salary      2
Bonus       1
Address    11
dtype: int64

In [67]:
# False = has null values
df.notnull()

                 Job    Age  Salary  Bonus  Address
Name
อาทิตย์         True   True    True   True    False
เกียรติศักดิ์   True   True   False   True    False
จักรพงษ์        True  False    True   True    False
สุรชัย         False   True    True   True    False
ทศพล            True   True    True   True    False
จินตนา          True  False    True   True    False
NaN            False  False   False  False    False
เกษมสันต์       True   True    True   True    False
ชลธิชา         False   True    True   True    False
เกษมสันต์       True   True    True   True    False
ทศพล            True   True    True   True    False

In [69]:
# Find how many not null in each columns
df.notnull().sum()

Job         8
Age         8
Salary      9
Bonus      10
Address     0
dtype: int64

In [87]:
import pandas as pd
df = pd.read_excel("Employee.xlsx", index_col="Name")
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN       NaN    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, อาทิตย์ to ทศพล
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Job      8 non-null      object
 1   Age      8 non-null      float64
 2   Salary   9 non-null      float64
 3   Bonus    10 non-null     float64
 4   Address  0 non-null      float64
dtypes: float64(4), object(1)
memory usage: 828.0+ bytes

In [73]:
df.describe()

             Age         Salary  Bonus  Address
count   8.000000       9.000000   10.0      0.0
mean   26.625000   94666.666667    0.1      NaN
std     5.998512  134985.184372    0.0      NaN
min    18.000000   30000.000000    0.1      NaN
25%    22.250000   40000.000000    0.1      NaN
50%    27.500000   40000.000000    0.1      NaN
75%    30.250000   60000.000000    0.1      NaN
max    34.000000  450000.000000    0.1      NaN

In [82]:
df.Salary.fillna(df["Salary"].mean())

Name
อาทิตย์           30000.000000
เกียรติศักดิ์     94666.666667
จักรพงษ์          32000.000000
สุรชัย            40000.000000
ทศพล              40000.000000
จินตนา           450000.000000
NaN               94666.666667
เกษมสันต์         60000.000000
ชลธิชา           100000.000000
เกษมสันต์         60000.000000
ทศพล              40000.000000
Name: Salary, dtype: float64

In [84]:
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())
df

                      Job   Age         Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.000000    0.1      NaN
เกียรติศักดิ์  Programmer  18.0   94666.666667    0.1      NaN
จักรพงษ์        Developer   NaN   32000.000000    0.1      NaN
สุรชัย                NaN  23.0   40000.000000    0.1      NaN
ทศพล                 Sale  29.0   40000.000000    0.1      NaN
จินตนา            Manager   NaN  450000.000000    0.1      NaN
NaN                   NaN   NaN   94666.666667    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.000000    0.1      NaN
ชลธิชา                NaN  26.0  100000.000000    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.000000    0.1      NaN
ทศพล                 Sale  29.0   40000.000000    0.1      NaN

In [86]:
select = "Salary"
df[select] = df[select].fillna(df[select].mean())
df

                      Job   Age         Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.000000    0.1      NaN
เกียรติศักดิ์  Programmer  18.0   94666.666667    0.1      NaN
จักรพงษ์        Developer   NaN   32000.000000    0.1      NaN
สุรชัย                NaN  23.0   40000.000000    0.1      NaN
ทศพล                 Sale  29.0   40000.000000    0.1      NaN
จินตนา            Manager   NaN  450000.000000    0.1      NaN
NaN                   NaN   NaN   94666.666667    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.000000    0.1      NaN
ชลธิชา                NaN  26.0  100000.000000    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.000000    0.1      NaN
ทศพล                 Sale  29.0   40000.000000    0.1      NaN

In [88]:
select = "Salary"
df[select] = df[select].fillna(18000)
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0   18000.0    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN   18000.0    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [89]:
import pandas as pd
df = pd.read_excel("Employee.xlsx", index_col="Name")
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN       NaN    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [95]:
#fill null values by before values
df.fillna(method="pad", inplace=True)
df

C:\Users\pingl\AppData\Local\Temp\ipykernel_17864\376735735.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="pad", inplace=True)

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0   30000.0    0.1      NaN
จักรพงษ์        Developer  18.0   32000.0    0.1      NaN
สุรชัย          Developer  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager  29.0  450000.0    0.1      NaN
NaN               Manager  29.0  450000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา           Maketing  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [96]:
import pandas as pd
df = pd.read_excel("Employee.xlsx", index_col="Name")
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN       NaN    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [100]:
#fill null values by Next values
df.fillna("bfill", inplace=True)
df

                      Job   Age    Salary  Bonus Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1   bfill
เกียรติศักดิ์  Programmer  18.0   32000.0    0.1   bfill
จักรพงษ์        Developer  23.0   32000.0    0.1   bfill
สุรชัย               Sale  23.0   40000.0    0.1   bfill
ทศพล                 Sale  29.0   40000.0    0.1   bfill
จินตนา            Manager  34.0  450000.0    0.1   bfill
NaN              Maketing  34.0   60000.0    0.1   bfill
เกษมสันต์        Maketing  34.0   60000.0    0.1   bfill
ชลธิชา           Maketing  26.0  100000.0    0.1   bfill
เกษมสันต์        Maketing  34.0   60000.0    0.1   bfill
ทศพล                 Sale  29.0   40000.0    0.1   bfill

In [107]:
import pandas as pd
df = pd.read_excel("Employee.xlsx", index_col="Name")
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN       NaN    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [102]:
# Remove By row
df.dropna(inplace=True)
df

Empty DataFrame
Columns: [Job, Age, Salary, Bonus, Address]
Index: []

In [111]:
# remove specific columns has null (remove by row)
df.dropna(subset=["Job", "Salary"], inplace=True)
df

                  Job   Age    Salary  Bonus  Address
Name
อาทิตย์    Programmer  20.0   30000.0    0.1      NaN
จักรพงษ์    Developer   NaN   32000.0    0.1      NaN
ทศพล             Sale  29.0   40000.0    0.1      NaN
จินตนา        Manager   NaN  450000.0    0.1      NaN
เกษมสันต์    Maketing  34.0   60000.0    0.1      NaN
เกษมสันต์    Maketing  34.0   60000.0    0.1      NaN
ทศพล             Sale  29.0   40000.0    0.1      NaN

In [110]:
#remove by colmun
import pandas as pd
df = pd.read_excel("Employee.xlsx", index_col="Name")
df

                      Job   Age    Salary  Bonus  Address
Name
อาทิตย์        Programmer  20.0   30000.0    0.1      NaN
เกียรติศักดิ์  Programmer  18.0       NaN    0.1      NaN
จักรพงษ์        Developer   NaN   32000.0    0.1      NaN
สุรชัย                NaN  23.0   40000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN
จินตนา            Manager   NaN  450000.0    0.1      NaN
NaN                   NaN   NaN       NaN    NaN      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ชลธิชา                NaN  26.0  100000.0    0.1      NaN
เกษมสันต์        Maketing  34.0   60000.0    0.1      NaN
ทศพล                 Sale  29.0   40000.0    0.1      NaN

In [112]:
df.dropna(axis=1, inplace=True)
df

                  Job    Salary  Bonus
Name
อาทิตย์    Programmer   30000.0    0.1
จักรพงษ์    Developer   32000.0    0.1
ทศพล             Sale   40000.0    0.1
จินตนา        Manager  450000.0    0.1
เกษมสันต์    Maketing   60000.0    0.1
เกษมสันต์    Maketing   60000.0    0.1
ทศพล             Sale   40000.0    0.1

In [113]:
# Remove Duplicate data
df[df.duplicated()]

                Job   Salary  Bonus
Name
เกษมสันต์  Maketing  60000.0    0.1
ทศพล           Sale  40000.0    0.1

In [114]:
df.drop_duplicates(inplace=True)
df

                  Job    Salary  Bonus
Name
อาทิตย์    Programmer   30000.0    0.1
จักรพงษ์    Developer   32000.0    0.1
ทศพล             Sale   40000.0    0.1
จินตนา        Manager  450000.0    0.1
เกษมสันต์    Maketing   60000.0    0.1